<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"b3ec98696588a5b50a4c8b5f76e3e458922639357512ea99615eb768ff7c0a41","plan_job_ref":"Job terraform-plan-05-aws-complete #53 at https://github.com/pipetail/terraform/actions/runs/4768853067","plan_hash":"ea51b11214d731092e386b6516a9205cfee7647130b199e163634af0e5fbf89f","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan in __examples/05-aws-complete__
<details>
<summary>Plan: 46 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.allow_command_exec will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "allow_command_exec" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "ssmmessages:CreateControlChannel",
              + "ssmmessages:CreateDataChannel",
              + "ssmmessages:OpenControlChannel",
              + "ssmmessages:OpenDataChannel",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:DescribeLogGroups",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.loki_ecs_task_execution_role will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "loki_ecs_task_execution_role" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "AllowECSToAuthenticateToECRInCentralAccount"
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForLayer",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowECSToPullImage"
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowECSToWriteLogsToCloudWatchLogs"
        }
    }

  # data.aws_iam_policy_document.loki_storage will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "loki_storage" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "AllowLokiStorageChunksS3"
        }
    }

  # aws_budgets_budget.cost will be created
  + resource "aws_budgets_budget" "cost" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + cost_filters      = (known after apply)
      + id                = (known after apply)
      + limit_amount      = "100"
      + limit_unit        = "USD"
      + name              = "overall-cost"
      + name_prefix       = (known after apply)
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = (known after apply)
      + time_unit         = "MONTHLY"

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "marek.bartik@pipetail.io",
            ]
          + subscriber_sns_topic_arns  = []
          + threshold                  = 90
          + threshold_type             = "PERCENTAGE"
        }
    }

  # aws_cloudtrail.main will be created
  + resource "aws_cloudtrail" "main" {
      + arn                           = (known after apply)
      + enable_log_file_validation    = true
      + enable_logging                = true
      + home_region                   = (known after apply)
      + id                            = (known after apply)
      + include_global_service_events = true
      + is_multi_region_trail         = true
      + is_organization_trail         = false
      + name                          = "complete-example-main"
      + s3_bucket_name                = (known after apply)
      + tags_all                      = (known after apply)
    }

  # aws_cloudwatch_log_group.command_execution will be created
  + resource "aws_cloudwatch_log_group" "command_execution" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "***************************************************************************"
      + name              = "ecs-command-execution"
      + retention_in_days = 30
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.loki will be created
  + resource "aws_cloudwatch_log_group" "loki" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "loki"
      + retention_in_days = 30
      + tags_all          = (known after apply)
    }

  # aws_ecr_repository.grafana will be created
  + resource "aws_ecr_repository" "grafana" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "grafana"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecs_cluster.grafana will be created
  + resource "aws_ecs_cluster" "grafana" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "grafana"
      + tags               = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "grafana"
        }
      + tags_all           = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "grafana"
        }

      + configuration {
          + execute_command_configuration {
              + kms_key_id = "***************************************************************************"
              + logging    = "OVERRIDE"

              + log_configuration {
                  + cloud_watch_encryption_enabled = true
                  + cloud_watch_log_group_name     = "ecs-command-execution"
                }
            }
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.loki will be created
  + resource "aws_ecs_service" "loki" {
      + cluster                            = "grafana"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "loki"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-03707a77eb11c6e25",
            ]
          + subnets          = [
              + "subnet-08e8ce7b0e7a0956e",
              + "subnet-0c9dcfe6e1c893a2b",
            ]
        }

      + service_registries {
          + registry_arn = "arn:aws:servicediscovery:eu-west-1:175912345102:service/srv-moqpvx2bsljrlnfo"
        }
    }

  # aws_ecs_task_definition.loki will be created
  + resource "aws_ecs_task_definition" "loki" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + essential        = true
                  + image            = "175912345102.dkr.ecr.eu-west-1.amazonaws.com/grafana:loki-2.6.1-arm64"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "loki"
                          + awslogs-region        = "eu-west-1"
                          + awslogs-stream-prefix = "loki"
                        }
                    }
                  + name             = "loki"
                  + portMappings     = [
                      + {
                          + containerPort = 3100
                          + hostPort      = 3100
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "4096"
      + execution_role_arn       = (known after apply)
      + family                   = "loki_task_definition"
      + id                       = (known after apply)
      + memory                   = "8192"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)

      + runtime_platform {
          + cpu_architecture = "ARM64"
        }
    }

  # aws_elasticache_parameter_group.redis will be created
  + resource "aws_elasticache_parameter_group" "redis" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + family      = "redis6.x"
      + id          = (known after apply)
      + name        = "redis6-x"
      + tags_all    = (known after apply)

      + parameter {
          + name  = "activerehashing"
          + value = "yes"
        }
    }

  # aws_elasticache_replication_group.redis will be created
  + resource "aws_elasticache_replication_group" "redis" {
      + apply_immediately              = (known after apply)
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = (known after apply)
      + auto_minor_version_upgrade     = (known after apply)
      + automatic_failover_enabled     = true
      + cluster_enabled                = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + data_tiering_enabled           = (known after apply)
      + description                    = "redis cluster"
      + engine                         = "redis"
      + engine_version                 = "6.2"
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = (known after apply)
      + id                             = (known after apply)
      + maintenance_window             = (known after apply)
      + member_clusters                = (known after apply)
      + multi_az_enabled               = false
      + node_type                      = "cache.t4g.small"
      + num_cache_clusters             = 2
      + num_node_groups                = (known after apply)
      + number_cache_clusters          = (known after apply)
      + parameter_group_name           = "redis6-x"
      + port                           = 6379
      + preferred_cache_cluster_azs    = [
          + "eu-west-1a",
          + "eu-west-1b",
        ]
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replicas_per_node_group        = (known after apply)
      + replication_group_description  = (known after apply)
      + replication_group_id           = "*************"
      + security_group_ids             = [
          + "sg-08421588c9cba8407",
        ]
      + security_group_names           = (known after apply)
      + snapshot_window                = (known after apply)
      + subnet_group_name              = "complete-example-main-vpc"
      + tags_all                       = (known after apply)
      + transit_encryption_enabled     = (known after apply)
    }

  # aws_iam_group.eks_access_administrator will be created
  + resource "aws_iam_group" "eks_access_administrator" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "eks-administrators"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # aws_iam_group_policy_attachment.eks_access_administrator will be created
  + resource "aws_iam_group_policy_attachment" "eks_access_administrator" {
      + group      = "eks-administrators"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # aws_iam_policy.eks_access_administrator_allow_assume will be created
  + resource "aws_iam_policy" "eks_access_administrator_allow_assume" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "eks_administrator_allow_assume"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_policy.eks_kubeconfig will be created
  + resource "aws_iam_policy" "eks_kubeconfig" {
      + arn         = (known after apply)
      + description = "allow obtaining of kubeconfig for all EKS clusters"
      + id          = (known after apply)
      + name        = "eks_kubeconfig"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "eks:DescribeCluster",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.eks_access_administrator will be created
  + resource "aws_iam_role" "eks_access_administrator" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::175912345102:root",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks_administrator"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.loki_ecs_task will be created
  + resource "aws_iam_role" "loki_ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "AllowECSTasksToAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "loki-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.loki_ecs_task_execution will be created
  + resource "aws_iam_role" "loki_ecs_task_execution" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "AllowECSTasksToAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "loki-ecs-task-execution"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.loki_ecs_task_command_exec will be created
  + resource "aws_iam_role_policy" "loki_ecs_task_command_exec" {
      + id     = (known after apply)
      + name   = "loki-ecs-command-exec"
      + policy = (known after apply)
      + role   = "loki-ecs-task"
    }

  # aws_iam_role_policy.loki_ecs_task_execution will be created
  + resource "aws_iam_role_policy" "loki_ecs_task_execution" {
      + id     = (known after apply)
      + name   = "loki-ecs-task-execution"
      + policy = (known after apply)
      + role   = "loki-ecs-task-execution"
    }

  # aws_iam_role_policy.loki_storage will be created
  + resource "aws_iam_role_policy" "loki_storage" {
      + id     = (known after apply)
      + name   = "loki-storage-access"
      + policy = (known after apply)
      + role   = "loki-ecs-task"
    }

  # aws_iam_role_policy_attachment.eks_access_administrator_kubeconfig will be created
  + resource "aws_iam_role_policy_attachment" "eks_access_administrator_kubeconfig" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eks_administrator"
    }

  # aws_iam_role_policy_attachment.loki_ecs_task_execution will be created
  + resource "aws_iam_role_policy_attachment" "loki_ecs_task_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "loki-ecs-task-execution"
    }

  # aws_s3_bucket.cloudtrail will be created
  + resource "aws_s3_bucket" "cloudtrail" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "complete-example-cloudtrail"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.loki will be created
  + resource "aws_s3_bucket" "loki" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "complete-example-loki-storage"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_acl.loki will be created
  + resource "aws_s3_bucket_acl" "loki" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_bucket_policy.cloudtrail will be created
  + resource "aws_s3_bucket_policy" "cloudtrail" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.cloudtrail will be created
  + resource "aws_s3_bucket_public_access_block" "cloudtrail" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.loki will be created
  + resource "aws_s3_bucket_public_access_block" "loki" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.cloudtrail will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "cloudtrail" {
      + bucket = "complete-example-cloudtrail"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.loki will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "loki" {
      + bucket = "complete-example-loki-storage"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_versioning.loki will be created
  + resource "aws_s3_bucket_versioning" "loki" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.eks.data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.eks.data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster" {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # module.eks.data.tls_certificate.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "cluster" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_iam_openid_connect_provider.eks will be created
  + resource "aws_iam_openid_connect_provider" "eks" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.ssm will be created
  + resource "aws_iam_role_policy_attachment" "ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = (known after apply)
    }

  # module.eks.aws_kms_alias.secrets_encryption will be created
  + resource "aws_kms_alias" "secrets_encryption" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/eks_complete-example-prod_encryption"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = "***************************************************************************"
    }

  # module.vpc.aws_db_subnet_group.database[0] will be created
  + resource "aws_db_subnet_group" "database" {
      + arn                     = (known after apply)
      + description             = "Database subnet group for complete-example-main-vpc"
      + id                      = (known after apply)
      + name                    = "complete-example-main-vpc"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-02a4830f1b5915133",
          + "subnet-07157e377b2fa1881",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "complete-example-main-vpc"
        }
      + tags_all                = {
          + "Name" = "complete-example-main-vpc"
        }
    }

  # module.vpc.aws_elasticache_subnet_group.elasticache[0] will be created
  + resource "aws_elasticache_subnet_group" "elasticache" {
      + arn         = (known after apply)
      + description = "ElastiCache subnet group for complete-example-main-vpc"
      + id          = (known after apply)
      + name        = "complete-example-main-vpc"
      + subnet_ids  = [
          + "subnet-09c8df0346585b7ad",
          + "subnet-0f38504caed196e58",
        ]
      + tags        = {
          + "Name" = "complete-example-main-vpc"
        }
      + tags_all    = {
          + "Name" = "complete-example-main-vpc"
        }
    }

  # module.eks.module.eks.data.http.wait_for_cluster[0] will be read during apply
  # (config refers to values not yet known)
 <= data "http" "wait_for_cluster" {
      + body             = (known after apply)
      + ca_certificate   = (known after apply)
      + id               = (known after apply)
      + response_headers = (known after apply)
      + timeout          = 300
      + url              = (known after apply)
    }

  # module.eks.module.eks.aws_autoscaling_group.workers_launch_template[0] will be created
  + resource "aws_autoscaling_group" "workers_launch_template" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + capacity_rebalance        = false
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + max_instance_lifetime     = 0
      + max_size                  = 6
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = "complete-example-prod-main"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + suspended_processes       = [
          + "AZRebalance",
        ]
      + termination_policies      = []
      + vpc_zone_identifier       = [
          + "subnet-08e8ce7b0e7a0956e",
          + "subnet-0c9dcfe6e1c893a2b",
        ]
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "complete-example-prod-main-eks_asg"
        }
      + tag {
          + key                 = "k8s.io/cluster-autoscaler/complete-example-prod"
          + propagate_at_launch = false
          + value               = "owned"
        }
      + tag {
          + key                 = "k8s.io/cluster-autoscaler/enabled"
          + propagate_at_launch = false
          + value               = "true"
        }
      + tag {
          + key                 = "k8s.io/cluster-autoscaler/node-template/label/nodepool"
          + propagate_at_launch = true
          + value               = "main"
        }
      + tag {
          + key                 = "kubernetes.io/cluster/complete-example-prod"
          + propagate_at_launch = true
          + value               = "owned"
        }
    }

  # module.eks.module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "complete-example-prod"
      + platform_version      = (known after apply)
      + role_arn              = "arn:aws:iam::175912345102:role/complete-example-prod20230416184423097400000003"
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = "1.22"

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = "arn:aws:kms:eu-west-1:175912345102:key/a578eca4-66ee-4a48-a309-4dd41bf9006e"
            }
        }

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)
        }

      + timeouts {
          + create = "30m"
          + delete = "15m"
          + update = "60m"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = [
              + "sg-03eec5b8787efe4ba",
            ]
          + subnet_ids                = [
              + "subnet-08e8ce7b0e7a0956e",
              + "subnet-0c9dcfe6e1c893a2b",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.module.eks.aws_iam_instance_profile.workers_launch_template[0] will be created
  + resource "aws_iam_instance_profile" "workers_launch_template" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "complete-example-prod"
      + path        = "/"
      + role        = (known after apply)
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.eks.module.eks.aws_iam_role.workers[0] will be created
  + resource "aws_iam_role" "workers" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSWorkerAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "complete-example-prod"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.module.eks.aws_launch_template.workers_launch_template[0] will be created
  + resource "aws_launch_template" "workers_launch_template" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + ebs_optimized          = "true"
      + id                     = (known after apply)
      + image_id               = "*********************"
      + instance_type          = "m5a.large"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "complete-example-prod-main"
      + tags_all               = (known after apply)
      + update_default_version = false
      + user_data              = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "false"
              + iops                  = 0
              + throughput            = (known after apply)
              + volume_size           = 2
              + volume_type           = "gp2"
            }
        }
      + block_device_mappings {
          + device_name = "/dev/xvdb"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "false"
              + iops                  = 0
              + throughput            = (known after apply)
              + volume_size           = 20
              + volume_type           = "gp3"
            }
        }

      + credit_specification {
          + cpu_credits = "standard"
        }

      + enclave_options {
          + enabled = false
        }

      + iam_instance_profile {
          + name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "********"
          + instance_metadata_tags      = "disabled"
        }

      + monitoring {
          + enabled = true
        }

      + network_interfaces {
          + associate_public_ip_address = "false"
          + delete_on_termination       = "true"
          + security_groups             = [
              + "sg-060f3ec5677c2a681",
            ]
        }

      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name"                                                   = "complete-example-prod-main-eks_asg"
              + "k8s.io/cluster-autoscaler/node-template/label/nodepool" = "main"
            }
        }
      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name" = "complete-example-prod-main-eks_asg"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name"                                                   = "complete-example-prod-main-eks_asg"
              + "k8s.io/cluster-autoscaler/node-template/label/nodepool" = "main"
            }
        }
    }

  # module.eks.module.eks.kubernetes_config_map.aws_auth[0] will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = (known after apply)
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "Terraform"
              + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
            }
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_complete-example-prod"
      + id                   = (known after apply)
    }

Plan: 46 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [terraform-plan-05-aws-complete #53](https://github.com/pipetail/terraform/actions/runs/4768853067)